app/controllers/posts_controller.rb

    def index
        # @posts = Post.all
        @posts = Post.all.sort_by {|post| post.id}.reverse
---
SELECT "posts".* FROM "posts"

    def create
        @user = User.find(params[:user_id])
        @post = Post.new(post_params)
        @post.user_id = @user.id
        @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("description", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "TEST"], ["content", "TEST POST"], ["user_id", 1], ["created_at", "2019-09-12 22:00:55.984361"], ["updated_at", "2019-09-12 22:00:55.984361"]]

    def update
       find_post
       @post.update(params.require(:post).permit(:description))
---
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "City---NEWYORK\r\n"], ["updated_at", "2019-09-12 21:49:21.082446"], ["id", 1]]

    def destroy
        find_post
        @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]