app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "posts".* FROM "posts"
---
    def index
        @users = User.all
        @posts = Post.all.sort_by {|post| post.id}.reverse

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"
---
    def show
        @user = User.find(params[:id])
        @sorted_posts = @user.posts.sort.reverse
        @posts = Post.all.sort_by {|post| post.id}.reverse

INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save